devbis/zephyr-tlsr8258/include/zephyr/dt-bindings/pinctrl/tlsr8258-pinctrl.h
/*
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_TLSR8258_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_TLSR8258_PINCTRL_H_

#include <zephyr/dt-bindings/dt-util.h>

#define TLSR8258_GPIO_GROUPA 0x000
#define TLSR8258_GPIO_GROUPB 0x100
#define TLSR8258_GPIO_GROUPC 0x200
#define TLSR8258_GPIO_GROUPD 0x300
#define TLSR8258_GPIO_GROUPE 0x400

#define TLSR8258_GPIO_PA0 (TLSR8258_GPIO_GROUPA | BIT(0))
#define TLSR8258_GPIO_PA1 (TLSR8258_GPIO_GROUPA | BIT(1))
#define TLSR8258_GPIO_PA2 (TLSR8258_GPIO_GROUPA | BIT(2))
#define TLSR8258_GPIO_PA3 (TLSR8258_GPIO_GROUPA | BIT(3))
#define TLSR8258_GPIO_PA4 (TLSR8258_GPIO_GROUPA | BIT(4))
#define TLSR8258_GPIO_PA5 (TLSR8258_GPIO_GROUPA | BIT(5))
#define TLSR8258_GPIO_PA6 (TLSR8258_GPIO_GROUPA | BIT(6))
#define TLSR8258_GPIO_PA7 (TLSR8258_GPIO_GROUPA | BIT(7))

#define TLSR8258_GPIO_PB0 (TLSR8258_GPIO_GROUPB | BIT(0))
#define TLSR8258_GPIO_PB1 (TLSR8258_GPIO_GROUPB | BIT(1))
#define TLSR8258_GPIO_PB2 (TLSR8258_GPIO_GROUPB | BIT(2))
#define TLSR8258_GPIO_PB3 (TLSR8258_GPIO_GROUPB | BIT(3))
#define TLSR8258_GPIO_PB4 (TLSR8258_GPIO_GROUPB | BIT(4))
#define TLSR8258_GPIO_PB5 (TLSR8258_GPIO_GROUPB | BIT(5))
#define TLSR8258_GPIO_PB6 (TLSR8258_GPIO_GROUPB | BIT(6))
#define TLSR8258_GPIO_PB7 (TLSR8258_GPIO_GROUPB | BIT(7))

#define TLSR8258_GPIO_PC0 (TLSR8258_GPIO_GROUPC | BIT(0))
#define TLSR8258_GPIO_PC1 (TLSR8258_GPIO_GROUPC | BIT(1))
#define TLSR8258_GPIO_PC2 (TLSR8258_GPIO_GROUPC | BIT(2))
#define TLSR8258_GPIO_PC3 (TLSR8258_GPIO_GROUPC | BIT(3))
#define TLSR8258_GPIO_PC4 (TLSR8258_GPIO_GROUPC | BIT(4))
#define TLSR8258_GPIO_PC5 (TLSR8258_GPIO_GROUPC | BIT(5))
#define TLSR8258_GPIO_PC6 (TLSR8258_GPIO_GROUPC | BIT(6))
#define TLSR8258_GPIO_PC7 (TLSR8258_GPIO_GROUPC | BIT(7))

#define TLSR8258_GPIO_PD0 (TLSR8258_GPIO_GROUPD | BIT(0))
#define TLSR8258_GPIO_PD1 (TLSR8258_GPIO_GROUPD | BIT(1))
#define TLSR8258_GPIO_PD2 (TLSR8258_GPIO_GROUPD | BIT(2))
#define TLSR8258_GPIO_PD3 (TLSR8258_GPIO_GROUPD | BIT(3))
#define TLSR8258_GPIO_PD4 (TLSR8258_GPIO_GROUPD | BIT(4))
#define TLSR8258_GPIO_PD5 (TLSR8258_GPIO_GROUPD | BIT(5))
#define TLSR8258_GPIO_PD6 (TLSR8258_GPIO_GROUPD | BIT(6))
#define TLSR8258_GPIO_PD7 (TLSR8258_GPIO_GROUPD | BIT(7))

#define TLSR8258_GPIO_PE0 (TLSR8258_GPIO_GROUPE | BIT(0))
#define TLSR8258_GPIO_PE1 (TLSR8258_GPIO_GROUPE | BIT(1))
#define TLSR8258_GPIO_PE2 (TLSR8258_GPIO_GROUPE | BIT(2))
#define TLSR8258_GPIO_PE3 (TLSR8258_GPIO_GROUPE | BIT(3))

#define TLSR8258_FUNC_GPIO 0
#define TLSR8258_FUNC_UART 3

#define TLSR8258_PINMUX(pin, func) (((func) << 16) | (pin))

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_TLSR8258_PINCTRL_H_ */
